# SetFailingElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessage..::..SetFailingElements Method
FailureMessage Class See Also
---
Sets elements that have caused the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureMessage SetFailingElements(
	ICollection<ElementId> idsToShow
)
```

Visual Basic
---
```text
Public Function SetFailingElements ( _
	idsToShow As ICollection(Of ElementId) _
) As FailureMessage
```

Visual C++
---
```text
public:
FailureMessage^ SetFailingElements(
	ICollection<ElementId^>^ idsToShow
)
```

# ### Parameters
idsToShow
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The elements that have caused the failure.
# ### Return Value
The FailureMessage.
# Remarks
In the Revit error dialog these elements will be highlighted to the user and can be deleted by user via extended error dialog.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailureMessage is already posted to a document |

# See Also
FailureMessage Class
Autodesk.Revit.DB Namespace